{
	"FormatVersion": 2,
	"Namespace": "",
	"Subnamespaces": [
		{
			"Namespace": "UICommands",
			"Subnamespaces": [
				{
					"Namespace": "ZibraVDBForUnreal",
					"Children": [
						{
							"Source":
							{
								"Text": "Export .zibravdb"
							},
							"Translation":
							{
								"Text": "Export .zibravdb"
							},
							"Key": "ExportCommand"
						},
						{
							"Source":
							{
								"Text": "Export .zibravdb volume to file."
							},
							"Translation":
							{
								"Text": "Export .zibravdb volume to file."
							},
							"Key": "ExportCommand_ToolTip"
						},
						{
							"Source":
							{
								"Text": "Reimport"
							},
							"Translation":
							{
								"Text": "Reimport"
							},
							"Key": "ReimportCommand"
						},
						{
							"Source":
							{
								"Text": "Reimport the asset from the original source file."
							},
							"Translation":
							{
								"Text": "Reimport the asset from the original source file."
							},
							"Key": "ReimportCommand_ToolTip"
						}
					]
				}
			]
		},
		{
			"Namespace": "ZibraVDBForUnreal",
			"Children": [
				{
					"Source":
					{
						"Text": "About"
					},
					"Translation":
					{
						"Text": "About"
					},
					"Key": "ZibraVDBAboutSection"
				},
				{
					"Source":
					{
						"Text": "Bug Description"
					},
					"Translation":
					{
						"Text": "Bug Description"
					},
					"Key": "BugDescription"
				},
				{
					"Source":
					{
						"Text": "Bug Reporter"
					},
					"Translation":
					{
						"Text": "Bug Reporter"
					},
					"Key": "BugReporter"
				},
				{
					"Source":
					{
						"Text": "Bug report was sent successfully."
					},
					"Translation":
					{
						"Text": "Bug report was sent successfully."
					},
					"Key": "BugReportSentSuccessfully"
				},
				{
					"Source":
					{
						"Text": "Can't check for updates for this version. Current version is {0}. Latest version is {1}."
					},
					"Translation":
					{
						"Text": "Can't check for updates for this version. Current version is {0}. Latest version is {1}."
					},
					"Key": "UpdateCheckCantParseCurrentVersion"
				},
				{
					"Source":
					{
						"Text": "Cancel"
					},
					"Translation":
					{
						"Text": "Cancel"
					},
					"Key": "Cancel"
				},
				{
					"Source":
					{
						"Text": "Channel"
					},
					"Translation":
					{
						"Text": "Channel"
					},
					"Key": "Channel"
				},
				{
					"Source":
					{
						"Text": "Channels have different voxel size and won't be rendered properly (Actor: {0})."
					},
					"Translation":
					{
						"Text": "Channels have different voxel size and won't be rendered properly (Actor: {0})."
					},
					"Key": "DifferentVoxelSizeWarning"
				},
				{
					"Source":
					{
						"Text": "Check for updates"
					},
					"Translation":
					{
						"Text": "Check for updates"
					},
					"Key": "RunUpdateCheck"
				},
				{
					"Source":
					{
						"Text": "Check whether there is newer ZibraVDB version available"
					},
					"Translation":
					{
						"Text": "Check whether there is newer ZibraVDB version available"
					},
					"Key": "RunUpdateCheckDescription"
				},
				{
					"Source":
					{
						"Text": "Checking for updates..."
					},
					"Translation":
					{
						"Text": "Checking for updates..."
					},
					"Key": "UpdateCheckRun"
				},
				{
					"Source":
					{
						"Text": "Compress"
					},
					"Translation":
					{
						"Text": "Compress"
					},
					"Key": "Compress"
				},
				{
					"Source":
					{
						"Text": "Compression requires active license. You can enter your license details via Project Settings. You can purchase ZibraVDB license on https://zibra.ai"
					},
					"Translation":
					{
						"Text": "Compression requires active license. You can enter your license details via Project Settings. You can purchase ZibraVDB license on https://zibra.ai"
					},
					"Key": "TriedToCompressButLicenseNotVerified"
				},
				{
					"Source":
					{
						"Text": "Copy diagnostics info"
					},
					"Translation":
					{
						"Text": "Copy diagnostics info"
					},
					"Key": "CopyDiagnosticsInfo"
				},
				{
					"Source":
					{
						"Text": "Copy diagnostics information about system and project to the clipboard"
					},
					"Translation":
					{
						"Text": "Copy diagnostics information about system and project to the clipboard"
					},
					"Key": "CopyDiagnosticsInfoDescription"
				},
				{
					"Source":
					{
						"Text": "Could not load OpenVDBHelper DLL from {0}. ZibraVDB will not work."
					},
					"Translation":
					{
						"Text": "Could not load OpenVDBHelper DLL from {0}. ZibraVDB will not work."
					},
					"Key": "OpenVDBHelperDLLLoadFailed"
				},
				{
					"Source":
					{
						"Text": "Could not load ZibraVDB SDK DLL from {0}. ZibraVDB will not work."
					},
					"Translation":
					{
						"Text": "Could not load ZibraVDB SDK DLL from {0}. ZibraVDB will not work."
					},
					"Key": "ZibraVDBSDKDLLLoadFailed"
				},
				{
					"Source":
					{
						"Text": "Deprecation Warning"
					},
					"Translation":
					{
						"Text": "Deprecation Warning"
					},
					"Key": "DeprecationWarning"
				},
				{
					"Source":
					{
						"Text": "Details"
					},
					"Translation":
					{
						"Text": "Details"
					},
					"Key": "Details"
				},
				{
					"Source":
					{
						"Text": "Diagnostics"
					},
					"Translation":
					{
						"Text": "Diagnostics"
					},
					"Key": "ZibraVDBDiagnosticsSection"
				},
				{
					"Source":
					{
						"Text": "Diagnostics info is copied to the clipboard."
					},
					"Translation":
					{
						"Text": "Diagnostics info is copied to the clipboard."
					},
					"Key": "DiagnosticsInfoCopiedToClipboard"
				},
				{
					"Source":
					{
						"Text": "Error parsing server response. Current version is {0}. Latest version is {1}."
					},
					"Translation":
					{
						"Text": "Error parsing server response. Current version is {0}. Latest version is {1}."
					},
					"Key": "UpdateCheckCantParseLatestVersion"
				},
				{
					"Source":
					{
						"Text": "Error reading metadata from OpenVDB sequence {0}"
					},
					"Translation":
					{
						"Text": "Error reading metadata from OpenVDB sequence {0}"
					},
					"Key": "OpenVDBMetadataReadingFailure"
				},
				{
					"Source":
					{
						"Text": "Export .zibravdb file"
					},
					"Translation":
					{
						"Text": "Export .zibravdb file"
					},
					"Key": "ExportZibraVDBFile"
				},
				{
					"Source":
					{
						"Text": "Export asset to .zibravdb file"
					},
					"Translation":
					{
						"Text": "Export asset to .zibravdb file"
					},
					"Key": "ExportZibraVDBFileTooltip"
				},
				{
					"Source":
					{
						"Text": "Failed to import methods from OpenVDBHelper DLL. ZibraVDB will not work."
					},
					"Translation":
					{
						"Text": "Failed to import methods from OpenVDBHelper DLL. ZibraVDB will not work."
					},
					"Key": "OpenVDBHelperMethodLoadFailed"
				},
				{
					"Source":
					{
						"Text": "Failed to import methods from ZibraVDB SDK DLL. ZibraVDB will not work."
					},
					"Translation":
					{
						"Text": "Failed to import methods from ZibraVDB SDK DLL. ZibraVDB will not work."
					},
					"Key": "ZibraVDBSDKMethodLoadFailed"
				},
				{
					"Source":
					{
						"Text": "Failed to initialize compressor."
					},
					"Translation":
					{
						"Text": "Failed to initialize compressor."
					},
					"Key": "CompressorInitializationFailed"
				},
				{
					"Source":
					{
						"Text": "Failed to initialize decompressor: {0}"
					},
					"Translation":
					{
						"Text": "Failed to initialize decompressor: {0}"
					},
					"Key": "DecompressorInitializationFailure"
				},
				{
					"Source":
					{
						"Text": "Failed to load data from file."
					},
					"Translation":
					{
						"Text": "Failed to load data from file."
					},
					"Key": "LoadFileToArrayFailed"
				},
				{
					"Source":
					{
						"Text": "Failed to register decompression resources."
					},
					"Translation":
					{
						"Text": "Failed to register decompression resources."
					},
					"Key": "DecompressorResourceRegisterFailure"
				},
				{
					"Source":
					{
						"Text": "Failed to send bug report. Network request failed. Please check your internet connection."
					},
					"Translation":
					{
						"Text": "Failed to send bug report. Network request failed. Please check your internet connection."
					},
					"Key": "FailedToSendBugReportNetworkError"
				},
				{
					"Source":
					{
						"Text": "Failed to send bug report. Server responded with an error code {0}. Response: {1}."
					},
					"Translation":
					{
						"Text": "Failed to send bug report. Server responded with an error code {0}. Response: {1}."
					},
					"Key": "FailedToSendBugReportServerError"
				},
				{
					"Source":
					{
						"Text": "File does not exist."
					},
					"Translation":
					{
						"Text": "File does not exist."
					},
					"Key": "FileDoesntExist"
				},
				{
					"Source":
					{
						"Text": "Global Distance Field is disabled, received shadows won't work"
					},
					"Translation":
					{
						"Text": "Global Distance Field is disabled, received shadows won't work"
					},
					"Key": "GDFDisabledNoReceivedShadows"
				},
				{
					"Source":
					{
						"Text": "Import"
					},
					"Translation":
					{
						"Text": "Import"
					},
					"Key": "Import"
				},
				{
					"Source":
					{
						"Text": "Import .zibravdb File"
					},
					"Translation":
					{
						"Text": "Import .zibravdb File"
					},
					"Key": "ImportZibraVDBFile"
				},
				{
					"Source":
					{
						"Text": "Import OpenVDB Sequence"
					},
					"Translation":
					{
						"Text": "Import OpenVDB Sequence"
					},
					"Key": "ImportVDBSequence"
				},
				{
					"Source":
					{
						"Text": "Import OpenVDB Sequence"
					},
					"Translation":
					{
						"Text": "Import OpenVDB Sequence"
					},
					"Key": "ImportOpenVDBSequence"
				},
				{
					"Source":
					{
						"Text": "Include editor log"
					},
					"Translation":
					{
						"Text": "Include editor log"
					},
					"Key": "IncludeEditorLog"
				},
				{
					"Source":
					{
						"Text": "Initialization failed due to uninitialized RHI. ZibraVDB will not work."
					},
					"Translation":
					{
						"Text": "Initialization failed due to uninitialized RHI. ZibraVDB will not work."
					},
					"Key": "RHIUninitializedError"
				},
				{
					"Source":
					{
						"Text": "Initialization failed due to unsupported RHI. Current RHI is {0}, while only D3D12 is supported. ZibraVDB will not work."
					},
					"Translation":
					{
						"Text": "Initialization failed due to unsupported RHI. Current RHI is {0}, while only D3D12 is supported. ZibraVDB will not work."
					},
					"Key": "UnsupportedRHIError"
				},
				{
					"Source":
					{
						"Text": "Initialization failed due to unsupported Shader Model. Current Shader Model is {0}, while only SM6 is supported. ZibraVDB will not work."
					},
					"Translation":
					{
						"Text": "Initialization failed due to unsupported Shader Model. Current Shader Model is {0}, while only SM6 is supported. ZibraVDB will not work."
					},
					"Key": "UnsupportedSMError"
				},
				{
					"Source":
					{
						"Text": "Invalid license key format"
					},
					"Translation":
					{
						"Text": "Invalid license key format"
					},
					"Key": "InvalidLicenseKeyFormat"
				},
				{
					"Source":
					{
						"Text": "New version of ZibraVDB is available. Current version is {0}. Latest version is {1}."
					},
					"Translation":
					{
						"Text": "New version of ZibraVDB is available. Current version is {0}. Latest version is {1}."
					},
					"Key": "UpdateCheckNewVersionIsAvailable"
				},
				{
					"Source":
					{
						"Text": "Note that editor log may include certain information about your project."
					},
					"Translation":
					{
						"Text": "Note that editor log may include certain information about your project."
					},
					"Key": "IncludeEditorLogNote"
				},
				{
					"Source":
					{
						"Text": "Open Bug Reporter Window"
					},
					"Translation":
					{
						"Text": "Open Bug Reporter Window"
					},
					"Key": "OpenBugReporterWindow"
				},
				{
					"Source":
					{
						"Text": "Open Documentation"
					},
					"Translation":
					{
						"Text": "Open Documentation"
					},
					"Key": "OpenDocumentation"
				},
				{
					"Source":
					{
						"Text": "Open OpenVDB Sequence Import Window"
					},
					"Translation":
					{
						"Text": "Open OpenVDB Sequence Import Window"
					},
					"Key": "OpenOpenVDBSequenceImportWindow"
				},
				{
					"Source":
					{
						"Text": "Open website with plugin documentation"
					},
					"Translation":
					{
						"Text": "Open website with plugin documentation"
					},
					"Key": "OpenDocumentationDescription"
				},
				{
					"Source":
					{
						"Text": "Please enter bug description before submitting bug report."
					},
					"Translation":
					{
						"Text": "Please enter bug description before submitting bug report."
					},
					"Key": "PleaseEnterBugDescription"
				},
				{
					"Source":
					{
						"Text": "Please enter bug description here.\nMake sure to include all information relevant to reproducing the bug."
					},
					"Translation":
					{
						"Text": "Please enter bug description here.\nMake sure to include all information relevant to reproducing the bug."
					},
					"Key": "BugDescriptionPlaceholder"
				},
				{
					"Source":
					{
						"Text": "Please, select at least one channel to compress"
					},
					"Translation":
					{
						"Text": "Please, select at least one channel to compress"
					},
					"Key": "SelectAtLeastOneChannelToCompress"
				},
				{
					"Source":
					{
						"Text": "Plugin is up to date. Current version is {0}."
					},
					"Translation":
					{
						"Text": "Plugin is up to date. Current version is {0}."
					},
					"Key": "UpdateCheckUpToDate"
				},
				{
					"Source":
					{
						"Text": "Plugins"
					},
					"Translation":
					{
						"Text": "Plugins"
					},
					"Key": "PluginsSection"
				},
				{
					"Source":
					{
						"Text": "Quality"
					},
					"Translation":
					{
						"Text": "Quality"
					},
					"Key": "Quality"
				},
				{
					"Source":
					{
						"Text": "Reading metadata..."
					},
					"Translation":
					{
						"Text": "Reading metadata..."
					},
					"Key": "ReadingMetadata"
				},
				{
					"Source":
					{
						"Text": "Reimporting Asset..."
					},
					"Translation":
					{
						"Text": "Reimporting Asset..."
					},
					"Key": "ReimportingAsset"
				},
				{
					"Source":
					{
						"Text": "Selected OpenVDB files have no valid channels."
					},
					"Translation":
					{
						"Text": "Selected OpenVDB files have no valid channels."
					},
					"Key": "OpenVDBHasNoChannels"
				},
				{
					"Source":
					{
						"Text": "Selected asset path is not valid."
					},
					"Translation":
					{
						"Text": "Selected asset path is not valid."
					},
					"Key": "InvalidAssetPath"
				},
				{
					"Source":
					{
						"Text": "Selected path \"{0}\" has no OpenVDB files."
					},
					"Translation":
					{
						"Text": "Selected path \"{0}\" has no OpenVDB files."
					},
					"Key": "NoOpenVDBFiles"
				},
				{
					"Source":
					{
						"Text": "Sending Bug Report..."
					},
					"Translation":
					{
						"Text": "Sending Bug Report..."
					},
					"Key": "SendingBugReport"
				},
				{
					"Source":
					{
						"Text": "Set ZibraVDB License Key"
					},
					"Translation":
					{
						"Text": "Set ZibraVDB License Key"
					},
					"Key": "ZibraVDBLicenseSettingsDescription"
				},
				{
					"Source":
					{
						"Text": "Submit"
					},
					"Translation":
					{
						"Text": "Submit"
					},
					"Key": "Submit"
				},
				{
					"Source":
					{
						"Text": "The {0} has been successfully imported"
					},
					"Translation":
					{
						"Text": "The {0} has been successfully imported"
					},
					"Key": "SuccessfullyImported"
				},
				{
					"Source":
					{
						"Text": "There is no Sky Atmosphere, ambient lighting won't work"
					},
					"Translation":
					{
						"Text": "There is no Sky Atmosphere, ambient lighting won't work"
					},
					"Key": "NoSkyAtmosphereNoAmbientLighting"
				},
				{
					"Source":
					{
						"Text": "This actor already has overlay material on it. Please remove it first."
					},
					"Translation":
					{
						"Text": "This actor already has overlay material on it. Please remove it first."
					},
					"Key": "ActorAlreadyHasOverlayMaterial"
				},
				{
					"Source":
					{
						"Text": "Update check failed. Failed to parse response from the server. Please check your firewall settings or try again later. Server Response: {0}"
					},
					"Translation":
					{
						"Text": "Update check failed. Failed to parse response from the server. Please check your firewall settings or try again later. Server Response: {0}"
					},
					"Key": "UpdateCheckFailedBadResponse"
				},
				{
					"Source":
					{
						"Text": "Update check failed. Request was unsuccessful. Please check your internet connection and firewall settings or try again later."
					},
					"Translation":
					{
						"Text": "Update check failed. Request was unsuccessful. Please check your internet connection and firewall settings or try again later."
					},
					"Key": "UpdateCheckFailedNetworkError"
				},
				{
					"Source":
					{
						"Text": "Valid UZibraVDBVolume4 must be specified."
					},
					"Translation":
					{
						"Text": "Valid UZibraVDBVolume4 must be specified."
					},
					"Key": "UZibraVDBVolume4Required"
				},
				{
					"Source":
					{
						"Text": "Your license does not include Compression functionality. You can change your license via Project Settings. You can purchase new ZibraVDB license on https://zibra.ai"
					},
					"Translation":
					{
						"Text": "Your license does not include Compression functionality. You can change your license via Project Settings. You can purchase new ZibraVDB license on https://zibra.ai"
					},
					"Key": "TriedToCompressButLicenseNoCompression"
				},
				{
					"Source":
					{
						"Text": "ZibraVDB"
					},
					"Translation":
					{
						"Text": "ZibraVDB"
					},
					"Key": "ZibraVDBMenuName"
				},
				{
					"Source":
					{
						"Text": "ZibraVDB Actor"
					},
					"Translation":
					{
						"Text": "ZibraVDB Actor"
					},
					"Key": "ZibraVDBActor"
				},
				{
					"Source":
					{
						"Text": "ZibraVDB Asset"
					},
					"Translation":
					{
						"Text": "ZibraVDB Asset"
					},
					"Key": "ZibraVDBAssetTypeActions"
				},
				{
					"Source":
					{
						"Text": "ZibraVDB Asset Editor"
					},
					"Translation":
					{
						"Text": "ZibraVDB Asset Editor"
					},
					"Key": "ZibraVDBAssetEditorName"
				},
				{
					"Source":
					{
						"Text": "ZibraVDB Assets"
					},
					"Translation":
					{
						"Text": "ZibraVDB Assets"
					},
					"Key": "ZibraVDBAssets"
				},
				{
					"Source":
					{
						"Text": "ZibraVDB Editor"
					},
					"Translation":
					{
						"Text": "ZibraVDB Editor"
					},
					"Key": "ZibraVDBEditorSettingsName"
				},
				{
					"Source":
					{
						"Text": "ZibraVDB Editor Settings"
					},
					"Translation":
					{
						"Text": "ZibraVDB Editor Settings"
					},
					"Key": "ZibraVDBEditorSettingsDescription"
				},
				{
					"Source":
					{
						"Text": "ZibraVDB License"
					},
					"Translation":
					{
						"Text": "ZibraVDB License"
					},
					"Key": "ZibraVDBLicenseSettingsName"
				},
				{
					"Source":
					{
						"Text": "ZibraVDB License Error"
					},
					"Translation":
					{
						"Text": "ZibraVDB License Error"
					},
					"Key": "ZibraVDBLicenseErrorTitle"
				},
				{
					"Source":
					{
						"Text": "ZibraVDB Plugin Features"
					},
					"Translation":
					{
						"Text": "ZibraVDB Plugin Features"
					},
					"Key": "ZibraVDBMenuTooltip"
				},
				{
					"Source":
					{
						"Text": "ZibraVDB: {0}"
					},
					"Translation":
					{
						"Text": "ZibraVDB: {0}"
					},
					"Key": "ZibraVDBNotificationPrefix"
				},
				{
					"Source":
					{
						"Text": "{0} Editor"
					},
					"Translation":
					{
						"Text": "{0} Editor"
					},
					"Key": "ZibraVDBAssetEditorToolTipText"
				}
			]
		}
	]
}